fsck.org
#+INCLUDE: ./main.setup
#+TITLE: fsck
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* Visión de conjunto
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: es
  :END:      

Verifique y repare un sistema de archivos Linux.

* Cómo instalar
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: es
  :END:      

# ** Prerequisites
#    :PROPERTIES: 
#    :CUSTOM_ID: prerequisites
#    :LANG_EN:  Prerequisites
#    :LANG_ES:  Requisitos previos
#    :LANG_KO:  필요 사항
#    :LANG_ZH:  先决条件
#    :LANG_JA:  前準備
#    :END:      

** Instalar
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: es
  :END:      

{{{BUILTIN}}}

# ** Installed Packages
#    :PROPERTIES: 
#    :CUSTOM_ID: packages
#    :LANG_EN:  Installed Packages
#    :LANG_ES:  Paquetes instalados
#    :LANG_KO:  설치된 패키지
#    :LANG_ZH:  安装的软件包
#    :LANG_JA:  インストールされたパッケージ
#    :END:      

# ** Check
#    :PROPERTIES: 
#    :CUSTOM_ID: check
#    :LANG_EN:  Check
#    :LANG_ES:  Comprobar
#    :LANG_KO:  확인
#    :LANG_ZH:  检查
#    :LANG_JA:  チェック
#    :END:      

* Uso
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: es
  :END:      

** Sintaxis
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: es
   :END:      

#+BEGIN_SRC sh
fsck [-lrsAVRTMNP] [-C [fd]] [-t fstype] [filesystem ... ] [--] [fs-specific-options]
#+END_SRC

** Descripción
   :PROPERTIES: 
   :CUSTOM_ID: description
   :LANG: es
   :END:      

- fsck  is  used  to  check  and optionally repair one or more Linux filesystems.
- filesys can be a device name (e.g.  /dev/hdc1, /dev/sdb2), a mount point (e.g.  /, /usr,
/home), or an ext2 label or UUID specifier (e.g.  UUID=8868abf6-88c5-4a83-98b8-bfc24057f7bd or LABEL=root).
- Normally, the fsck program will try to handle filesystems on different physical disk drives in parallel to reduce the total amount of time needed to check all of them.

- If  no  filesystems  are  specified  on  the command line, and the -A option is not specified, fsck will default to checking filesystems in /etc/fstab serially.  This is
equivalent to the -As options.

- The exit code returned by fsck is the sum of the following conditions:
  |   # |                                    |
  |-----+------------------------------------|
  |   0 | No errors                          |
  |   1 | Filesystem errors corrected        |
  |   2 | System should be rebooted          |
  |   4 | Filesystem errors left uncorrected |
  |   8 | Operational error                  |
  |  16 | Usage or syntax error              |
  |  32 | Checking canceled by user request  |
  | 128 | Shared-library error               |

- The exit code returned when multiple filesystems are checked is the bit-wise OR of the exit codes for each filesystem that is checked.
- In actuality, fsck is simply a front-end for the various filesystem checkers (fsck.fstype) available under Linux.  The filesystem-specific checker is searched for in the PATH environment variable. If the PATH is undefined then fallback to "/sbin".

Please see the filesystem-specific checker manual pages for further details.

** Configuración
   :PROPERTIES: 
   :CUSTOM_ID: configuration
   :LANG: es
   :END:      

{{{file(/etc/fstab)}}}

- FSCK_FORCE_ALL_PARALLEL
- FSCK_MAX_INST          
- PATH                   
- FSTAB_FILE             
- LIBBLKID_DEBUG=0xffff  
- LIBMOUNT_DEBUG=0xffff  
** Opciones
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: es
   :END:      



# ** Examples
#    :PROPERTIES: 
#    :CUSTOM_ID: examples
#    :LANG_EN:  Examples
#    :LANG_ES:  Ejemplos
#    :LANG_KO:  사용 예
#    :LANG_ZH:  例子
#    :LANG_JA:  例
#    :END:      

# * See also
#   :PROPERTIES: 
#   :CUSTOM_ID: seealso
#   :LANG_EN:  See also
#   :LANG_ES:  Ver también
#   :LANG_KO:  관련 항목
#   :LANG_ZH:  相关主题
#   :LANG_JA:  関連項目
#   :END:      

# * References
#   :PROPERTIES: 
#   :CUSTOM_ID: references
#   :LANG_EN:  References
#   :LANG_ES:  Referencias
#   :LANG_KO:  참고자료
#   :LANG_ZH:  参考
#   :LANG_JA:  参考
#   :END:      
