es/fsck.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<title>fsck</title>
<!-- 2018-02-25 Sun 05:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="fsck - Comandos de Linux">
<meta name="description" content="Verifique y repare un sistema de archivos Linux. ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="fsck - Comandos de Linux">
<meta property="og:description" content="Verifique y repare un sistema de archivos Linux. ">
<meta name="twitter:title" content="fsck - Comandos de Linux">
<meta name="twitter:description" content="Verifique y repare un sistema de archivos Linux. ">
</head>
<body>
<div id="content">
<h1 class="title">fsck</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Visión de conjunto</a></li>
<li><a href="#how-to-install">Cómo instalar</a>
<ul>
<li><a href="#install">Instalar</a></li>
</ul>
</li>
<li><a href="#usage">Uso</a>
<ul>
<li><a href="#syntax">Sintaxis</a></li>
<li><a href="#description">Descripción</a></li>
<li><a href="#configuration">Configuración</a></li>
<li><a href="#options">Opciones</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview"><a id="sec-1" name="sec-1"></a>Visión de conjunto</h2>
<div class="outline-text-2" id="text-overview">

<p>
Verifique y repare un sistema de archivos Linux.
</p>
</div>
</div>

<div id="outline-container-how-to-install" class="outline-2">
<h2 id="how-to-install"><a id="sec-2" name="sec-2"></a>Cómo instalar</h2>
<div class="outline-text-2" id="text-how-to-install">

</div>

<div id="outline-container-install" class="outline-3">
<h3 id="install"><a id="sec-2-1" name="sec-2-1"></a>Instalar</h3>
<div class="outline-text-3" id="text-install">

<p>
Este es el comando integrado.
</p>
</div>
</div>
</div>

<div id="outline-container-usage" class="outline-2">
<h2 id="usage"><a id="sec-3" name="sec-3"></a>Uso</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-syntax" class="outline-3">
<h3 id="syntax"><a id="sec-3-1" name="sec-3-1"></a>Sintaxis</h3>
<div class="outline-text-3" id="text-syntax">

<div class="org-src-container">

<pre class="src src-sh">fsck [-lrsAVRTMNP] [-C [fd]] [-t fstype] [filesystem ... ] [--] [fs-specific-options]
</pre>
</div>
</div>
</div>

<div id="outline-container-description" class="outline-3">
<h3 id="description"><a id="sec-3-2" name="sec-3-2"></a>Descripción</h3>
<div class="outline-text-3" id="text-description">

<ul class="org-ul">
<li>fsck  is  used  to  check  and optionally repair one or more Linux filesystems.
</li>
<li>filesys can be a device name (e.g.  /dev/hdc1, /dev/sdb2), a mount point (e.g.  /, /usr,
</li>
</ul>
<p>
/home), or an ext2 label or UUID specifier (e.g.  UUID=8868abf6-88c5-4a83-98b8-bfc24057f7bd or LABEL=root).
</p>
<ul class="org-ul">
<li>Normally, the fsck program will try to handle filesystems on different physical disk drives in parallel to reduce the total amount of time needed to check all of them.
</li>

<li>If  no  filesystems  are  specified  on  the command line, and the -A option is not specified, fsck will default to checking filesystems in /etc/fstab serially.  This is
</li>
</ul>
<p>
equivalent to the -As options.
</p>

<ul class="org-ul">
<li>The exit code returned by fsck is the sum of the following conditions:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">#</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="left">No errors</td>
</tr>

<tr>
<td class="right">1</td>
<td class="left">Filesystem errors corrected</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">System should be rebooted</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">Filesystem errors left uncorrected</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">Operational error</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left">Usage or syntax error</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left">Checking canceled by user request</td>
</tr>

<tr>
<td class="right">128</td>
<td class="left">Shared-library error</td>
</tr>
</tbody>
</table>
</li>

<li>The exit code returned when multiple filesystems are checked is the bit-wise OR of the exit codes for each filesystem that is checked.
</li>
<li>In actuality, fsck is simply a front-end for the various filesystem checkers (fsck.fstype) available under Linux.  The filesystem-specific checker is searched for in the PATH environment variable. If the PATH is undefined then fallback to "/sbin".
</li>
</ul>

<p>
Please see the filesystem-specific checker manual pages for further details.
</p>
</div>
</div>

<div id="outline-container-configuration" class="outline-3">
<h3 id="configuration"><a id="sec-3-3" name="sec-3-3"></a>Configuración</h3>
<div class="outline-text-3" id="text-configuration">

<p>
<span class="org-programming-file">/etc/fstab</span>
</p>

<ul class="org-ul">
<li>FSCK_FORCE_ALL_PARALLEL
</li>
<li>FSCK_MAX_INST          
</li>
<li>PATH                   
</li>
<li>FSTAB_FILE             
</li>
<li>LIBBLKID_DEBUG=0xffff  
</li>
<li>LIBMOUNT_DEBUG=0xffff  
</li>
</ul>
</div>
</div>
<div id="outline-container-options" class="outline-3">
<h3 id="options"><a id="sec-3-4" name="sec-3-4"></a>Opciones</h3>
<div class="outline-text-3" id="text-options">

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
